/*
Задание 1.
Напишите программу, которая работала бы следующим образом: в prompt вводится значение.
С помощью унарного плюса (арифметический оператор) необходимо преобразовать его в число,
затем проверить с помощью typeof, принадлежит ли оно к множеству Number.
  Если это число, то вывести в консоль чётное оно или нечётное.
  Если передано не число, выведите: «Упс, кажется, вы ошиблись».
*NaN, хоть и относится к типу Number, числом не является. Добавьте отдельную проверку для этого значения.
*/

let userNum = +prompt('Введите число, не равное нулю:')

if (isNaN(userNum) || userNum === 0 || typeof (userNum) !== 'number') {
  console.log('Упс, кажется, вы ошиблись')
} else {
  let numVariant = userNum % 2 === 0 ? 'чет' : 'нечет'
  console.log(`${userNum} является ${numVariant}ным`)
}
